In [ ]:
import pandas as pd
import os
from google.colab import drive

In [ ]:
pd.set_option('display.max_columns', None)
# display.[max_categories, max_columns, max_colwidth, max_dir_items,
#   max_info_columns, max_info_rows, max_rows, max_seq_items, memory_usage,
#   min_rows, multi_sparse, notebook_repr_html, pprint_nest_depth, precision,
#   show_dimensions]

In [ ]:
# 나의 구글 드라이브 연결
drive.mount("/content/drive")

Mounted at /content/drive

In [ ]:
path = './drive/MyDrive/Colab Notebooks/'

# 데이터 불러오기

In [ ]:
# 산림재해 관심인구 정보
df1 = pd.read_csv(path + "FPL080101.csv")
# 산림대피소 관심인구 정보
df2 = pd.read_csv(path + "FPL080201.csv")
# 산림재해 관심인구 관심지역 검색정보
df3 = pd.read_csv(path + "FPL080301.csv")
# 산림재해 연관 검색 키워드를 검색한 관심인구 정보
df4 = pd.read_csv(path + "FPL080401.csv")

# 산림재해

### df1 : 산림재해 관심인구 정보 (Total : 14,988)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 대구
|재해 | 산불 | 산사태 | 산림재해 | 병해충 | 재선충
|거주지 20 | 서울 | 경기 | 부산 | 인천 | 대구
|재해 | 산불 | 산림재해 | 산사태 | 병해충 | 재선충
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 충남
|재해 | 산불 | 산사태 | 산림재해 | 병해충 | 재선충
|||||||
|거주지 14560 | 서울 | 경기 | 인천 | 부산 | 대구
|재해 | 산불 | 산사태 | 산림재해 | 병해충 | 재선충

> 재선충 : 소나무에게 병 옮기는 벌레

`[2-30] 여 : 4,265(54.2%), 남 : 3,603(45.8%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|7,868(52.5%)|3,093(39.3%)|4,128(52.5%)
|20|2,830(18.9%)|570(7.2%)|827(10.5%)
|30|5,038(33.6%)|2,523(32.1%)|3,301(42.0%)

---

### df2 : 산림대피소 관심인구 정보 (Total : 2,302)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 인천 | 부산 | 대구
|대피소 | 소백산 연화봉 | 한라산 진달래밭 | 설악산 중청 | 덕유산 향적봉 | 북한산 대피소
|거주지 20 | 서울 | 경기 | 인천 | 부산 | 대구
|대피소 | 한라산 진달래밭 | 소백산 연화봉 | 덕유산 향적봉 | 북한산 대피소 | 설악산 중청
|거주지 30 | 서울 | 경기 | 인천 | 부산 | 대구
|대피소 | 소백산 연화봉 | 설악산 중청 | 한라산 진달래밭 | 설악산 소청 | 북한산 대피소
|||||||
|거주지 450 | 서울 | 경기 | 인천 | 부산 | 경남
|대피소 | 한라산 진달래밭 | 소백산 연화봉 | 북한산 대피소 | 설악산 중청 | 지리산 장터목

`[2-30] 여 : 394(32.9%), 남 : 803(67.1%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|1,197(52.0%)|311(26.0%)|420(35.1%)
|20|554(24.1%)|67(5.6%) | 108(9.0%)
|30|643(27.9%)|244(20.4%)|312(26.1%)

---

### df3 : 산림재해 관심인구 관심지역 검색정보 (Total : 7,706)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 부산 | 인천 | 충남
|재해 | 산불 | 산사태 | 산림재해 | 병해충 | 재선충
|거주지 20 | 서울 | 경기 | 부산 | 인천 | 충북
|재해 | 산불 | 산사태 | 산림재해 | 병해충 |
|거주지 30 | 서울 | 경기 | 부산 | 인천 | 충남
|재해 | 산불 | 산림재해 | 산사태 | 병해충 | 재선충
|||||||
|거주지 14560 | 서울 | 경기 | 부산 | 충남 | 인천
|재해 | 산불 | 산사태 | 산림재해 | 병해충 | 재선충

`[2-30] 여 : 2,475(59.4%), 남 : 1,689(40.6%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|4,164(54.0%)|1,734(41.6%)|2,239(53.8%)
|20|1,415(18.4%)|331(7.9%) | 383(9.2%)
|30|2,749(35.7%)|1,403(33.7%)|1,856(44.6%)

---

### df4 : 산림재해 연관 검색 키워드를 검색한 관심인구 정보 (Total : 340)

|순위| 1 | 2 | 3 | 4 | 5 |
|--|--|--|--|--|--|
|거주지 230 | 서울 | 경기 | 인천 | 부산 | 충남
|재해 | 산사태 | 산불 | 산림재해 |  |
|거주지 20 | 서울 | 경기 | 부산 | 충북 | 인천
|재해 | 산사태 | 산불 | 산림재해 |  |
|거주지 30 | 서울 | 경기 | 인천 | 부산 | 충남
|재해 | 산사태 | 산불 | 산림재해 |  |
|||||||
|거주지 14560 | 서울 | 경기 | 부산 | 대구 | 대전
|재해 | 산사태 | 산림재해 | 산불 |  |

`[2-30] 여 : 82(46.1%), 남 : 96(53.9%)`

|Age|관심인구|Car|job|
|--|--|--|--|
|2-30|178(52.4%)|65(36.5%)|102(57.3%)
|20|64(18.8%)|19(10.7%) | 21(11.8%)
|30|114(33.5%)|46(25.8%)|81(45.5%)

---

귀산 -> 남자  
산림 체험 및 산림 치유 -> 여자

---
---
# df1 : 산림재해 관심인구 정보 (Total : 14,988)

In [ ]:
len(df1)

14988

In [ ]:
df1.head()

,재해,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,산사태,우면산사사태사망사고…대법대피조치안한서초구배상책임,M,4,NaN,NaN,,,NaN,대구,동구,신서동,NaN
1,산림재해,생태산림재해방지위한경진대회,F,5,NaN,NaN,,,NaN,서울,금천구,가산동,NaN
2,산림재해,산악기상관측망…산림재해예측정밀도높인다,M,3,"사무직 (일반사무직, 공무원, 직업군인)",500~599만원,예,자녀 있음,연립주택/ 다세대/ 빌라,경기,성남시 중원구,중동,"준중형차 (아반떼, K3, 크루즈, 제타급 등)"
3,산사태,의령수도사산사태로매몰위험노출/뉴스렙기사,M,4,NaN,NaN,,,NaN,서울,관악구,청림동,NaN
4,산사태,산사태현장예방단의구성및운영에관한지침개정(안)행정예고,F,4,NaN,NaN,,,NaN,부산,사상구,학장동,NaN

In [ ]:
age_counts = df1['연령'].value_counts()
age_counts

4    5046
3    5038
2    2830
5    2044
1      21
6       9
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(7868, 52.5, 18.9, 33.6, 47.5)

In [ ]:
df1_23 = df1[df1['연령'].isin([2, 3])]
df1_2 = df1[(df1['연령'] == 2)]
df1_3 = df1[(df1['연령'] == 3)]
df1_1456 = df1[df1['연령'].isin([1, 4, 5, 6])]

In [ ]:
df1_23.head()

,재해,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
2,산림재해,산악기상관측망…산림재해예측정밀도높인다,M,3,"사무직 (일반사무직, 공무원, 직업군인)",500~599만원,예,자녀 있음,연립주택/ 다세대/ 빌라,경기,성남시 중원구,중동,"준중형차 (아반떼, K3, 크루즈, 제타급 등)"
9,산림재해,"산림재해예방을위한하늘의눈,강릉산림항공관리소드론산불예방훈련실시",F,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,예,자녀 없음,연립주택/ 다세대/ 빌라,서울,동작구,상도4동,NaN
10,산사태,청도태양광산사태/조선일보,F,2,"주부 (전업주부, 파트타임 근무 주부)",400~499만원,예,자녀 있음,아파트/ 주상복합,전남,목포시,옥암동,NaN
12,산사태,<산사태대비하기>산사태이렇게대비하자!,F,3,"전문직 (의사, 판검사, 예술가, 종교인)",600~699만원,예,자녀 있음,단독주택,서울,강서구,화곡1동,"준중형SUV (투싼, 스포티지, QM5, 티구안급 등)"
13,산림재해,여름철산림재해예방을위한산사태대책상황실가동!,F,2,"사무직 (일반사무직, 공무원, 직업군인)","1,000만원 이상",아니오,,아파트/ 주상복합,서울,송파구,잠실동,"준중형SUV (투싼, 스포티지, QM5, 티구안급 등)"

### 230대 성별

In [ ]:
sex_counts = df1_23['성별'].value_counts()
sex_counts

F    4265
M    3603
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(54.2, 45.8)

### 230대 직업

In [ ]:
df1_23['직업'].notnull().sum(), df1_23['소득'].notnull().sum()

(6271, 6269)

In [ ]:
job_counts = df1_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             2509
학생 (초중고학생, 대학생, 대학원생)               986
주부 (전업주부, 파트타임 근무 주부)               736
전문직 (의사, 판검사, 예술가, 종교인)             464
무직                                  406
교직 (교사, 유치원교사, 학원강사)                264
서비스직 (요식업, 숙박업, 미용실종업원)             186
자영업 (도소매업, 숙박업, 미용업)                164
기타                                  149
생산/노무직 (생산감독, 경비원, 공장근로자)           144
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        100
판매직 (상점점원, 보험설계사, 노점상)               77
관리직 (사장, 간부, 고위공무원)                  63
퇴직/연금생활자                             15
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)       8
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

학생 (초중고학생, 대학생, 대학원생)    986
주부 (전업주부, 파트타임 근무 주부)    736
퇴직/연금생활자                  15
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df1_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(52.5, 4128)

In [ ]:
job2_counts = df1_2['직업'].value_counts()
job3_counts = df1_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs

주부 (전업주부, 파트타임 근무 주부)    708
학생 (초중고학생, 대학생, 대학원생)     63
퇴직/연금생활자                  10
Name: 직업, dtype: int64

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df1_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df1_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(10.5, 827, 42.0, 3301)

### 230대 자동차

In [ ]:
car_counts = df1_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          765
중형차 (쏘나타, K5, 말리부, 골프급 등)           639
경차 (모닝, 스파크 등)                      487
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)    226
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)      223
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)    220
소형SUV/CUV (티볼리, QM3 등)              110
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         94
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         93
대형SUV (베라크루즈, 모하비, 투아렉급 등)           75
대형차 (제너시스, BMW5급 등)                  75
준중형파생 (벨로스터, I30 등)                  27
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)       26
기타 (승합차/트럭/화물차/기타 차량 등)              24
프리미엄 (에쿠스, BMW7급 등)                   8
중형파생 (I40 등)                          1
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df1_23) * 100, 1),\
car_counts.sum()

(39.3, 3093)

In [ ]:
car2_counts = df1_2['자동차'].value_counts()
car3_counts = df1_3['자동차'].value_counts()

round(car2_counts.sum() / len(df1_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df1_23) * 100, 1),\
car3_counts.sum()

(7.2, 570, 32.1, 2523)

### 230대 거주지

In [ ]:
df1_23['시도'].value_counts()[:5],\
df1_2['시도'].value_counts()[:5],\
df1_3['시도'].value_counts()[:5]

(서울    2441
 경기    1918
 부산     696
 인천     481
 대구     329
 Name: 시도, dtype: int64,
 서울    874
 경기    646
 부산    244
 인천    158
 대구    136
 Name: 시도, dtype: int64,
 서울    1567
 경기    1272
 부산     452
 인천     323
 충남     231
 Name: 시도, dtype: int64)

In [ ]:
df1_23[df1_23['시도'] == "서울"]['재해'].value_counts()[:6],\
df1_2[df1_2['시도'] == "서울"]['재해'].value_counts()[:6],\
df1_3[df1_3['시도'] == "서울"]['재해'].value_counts()[:6]

(산불      1305
 산사태      419
 산림재해     384
 병해충      332
 재선충        1
 Name: 재해, dtype: int64,
 산불      399
 산림재해    172
 산사태     164
 병해충     139
 Name: 재해, dtype: int64,
 산불      906
 산사태     255
 산림재해    212
 병해충     193
 재선충       1
 Name: 재해, dtype: int64)

In [ ]:
df1_1456['시도'].value_counts()[:5],\
df1_1456[df1_1456['시도'] == "서울"]['재해'].value_counts()[:6]

(서울    2464
 경기    1818
 부산     461
 인천     346
 대구     313
 Name: 시도, dtype: int64,
 산불      1396
 산사태      409
 산림재해     337
 병해충      316
 재선충        6
 Name: 재해, dtype: int64)

# df2 : 산림대피소 관심인구 정보 (Total : 2,302)

In [ ]:
len(df2)

2302

In [ ]:
df2.head()

,대피소,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,덕유산 향적봉,무주 덕유산국립공원의 1박2일과 향적봉대피소,M,4,NaN,NaN,,,NaN,서울,성동구,금호동3가,NaN
1,한라산 진달래밭,#성판악 #속대밭대피소 #사라오름 #진달래밭대피소 #한라산 #백록담,M,3,NaN,NaN,,,NaN,경북,영주시,풍기읍,NaN
2,지리산 노고단,#오스프리 #AURA #xCREW #기어리뷰어 지리산 노고단 대피소 1박 2일 _2...,M,4,NaN,NaN,,,NaN,광주,북구,두암1동,NaN
3,한라산 삼각봉,제주도 한라산 5 산우물 4월 산행 한라산 삼각봉 대피소 개미등 탐라계곡 육교 관음사,M,5,"관리직 (사장, 간부, 고위공무원)",800~899만원,예,자녀 있음,아파트/ 주상복합,서울,관악구,봉천동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
4,덕유산 향적봉,덕유산 ( 德裕山 ) 야생화 트레킹 3 ( 설천봉 ~ 향적봉 대피소 ),M,4,"기능직 (자동차정비, 운전기사, 안경사, 택시기사)",200~299만원,예,자녀 없음,아파트/ 주상복합,인천,부평구,부평1동,"대형SUV (베라크루즈, 모하비, 투아렉급 등)"

### 연령

In [ ]:
age_counts = df2['연령'].value_counts()
age_counts

4    690
3    643
2    554
5    415
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
age_counts.loc[2], round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
age_counts.loc[3], round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
age_counts.drop([2,3]).sum(), round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(1197, 52.0, 554, 24.1, 643, 27.9, 1105, 48.0)

In [ ]:
df2_23 = df2[df2['연령'].isin([2, 3])]
df2_2 = df2[(df2['연령'] == 2)]
df2_3 = df2[(df2['연령'] == 3)]
df2_1456 = df2[df2['연령'].isin([1, 4, 5, 6])]

### 230대 성별

In [ ]:
sex_counts = df2_23['성별'].value_counts()
sex_counts

M    803
F    394
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(32.9, 67.1)

### 230대 직업

In [ ]:
job_counts = df2_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             214
학생 (초중고학생, 대학생, 대학원생)              123
무직                                  39
주부 (전업주부, 파트타임 근무 주부)               39
전문직 (의사, 판검사, 예술가, 종교인)             38
서비스직 (요식업, 숙박업, 미용실종업원)             36
생산/노무직 (생산감독, 경비원, 공장근로자)           27
기타                                  24
자영업 (도소매업, 숙박업, 미용업)                22
교직 (교사, 유치원교사, 학원강사)                22
기능직 (자동차정비, 운전기사, 안경사, 택시기사)        15
판매직 (상점점원, 보험설계사, 노점상)              13
관리직 (사장, 간부, 고위공무원)                  5
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)      4
퇴직/연금생활자                             2
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

학생 (초중고학생, 대학생, 대학원생)    123
주부 (전업주부, 파트타임 근무 주부)     39
퇴직/연금생활자                   2
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df2_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(35.1, 420)

In [ ]:
job2_counts = df2_2['직업'].value_counts()
job3_counts = df2_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df2_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df2_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(9.0, 108, 26.1, 312)

### 230대 자동차

In [ ]:
car_counts = df2_23['자동차'].value_counts()
car_counts

중형차 (쏘나타, K5, 말리부, 골프급 등)           81
준중형차 (아반떼, K3, 크루즈, 제타급 등)          69
경차 (모닝, 스파크 등)                      43
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)      33
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)    20
소형차 (액센트, 프라이드, 아베오, 피아트급 등)        16
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)    10
소형SUV/CUV (티볼리, QM3 등)               9
기타 (승합차/트럭/화물차/기타 차량 등)              8
대형SUV (베라크루즈, 모하비, 투아렉급 등)           7
대형차 (제너시스, BMW5급 등)                  5
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         4
프리미엄 (에쿠스, BMW7급 등)                  4
준중형파생 (벨로스터, I30 등)                  2
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df2_23) * 100, 1),\
car_counts.sum()

(26.0, 311)

In [ ]:
car2_counts = df2_2['자동차'].value_counts()
car3_counts = df2_3['자동차'].value_counts()

round(car2_counts.sum() / len(df2_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df2_23) * 100, 1),\
car3_counts.sum()

(5.6, 67, 20.4, 244)

### 230대 거주지

In [ ]:
df2_23['시도'].value_counts()[:5],\
df2_2['시도'].value_counts()[:5],\
df2_3['시도'].value_counts()[:5]

(서울    405
 경기    305
 인천     81
 부산     71
 대구     58
 Name: 시도, dtype: int64,
 서울    179
 경기    136
 인천     40
 부산     34
 대구     21
 Name: 시도, dtype: int64,
 서울    226
 경기    169
 인천     41
 부산     37
 대구     37
 Name: 시도, dtype: int64)

In [ ]:
df2_23[df2_23['시도'] == "서울"]['대피소'].value_counts()[:5],\
df2_2[df2_2['시도'] == "서울"]['대피소'].value_counts()[:5],\
df2_3[df2_3['시도'] == "서울"]['대피소'].value_counts()[:5]

(소백산 연화봉     48
 한라산 진달래밭    46
 설악산 중청      35
 덕유산 향적봉     32
 북한산 대피소     32
 Name: 대피소, dtype: int64,
 한라산 진달래밭    25
 소백산 연화봉     23
 덕유산 향적봉     17
 북한산 대피소     13
 설악산 중청      13
 Name: 대피소, dtype: int64,
 소백산 연화봉     25
 설악산 중청      22
 한라산 진달래밭    21
 설악산 소청      19
 북한산 대피소     19
 Name: 대피소, dtype: int64)

In [ ]:
df2_1456['시도'].value_counts()[:5],\
df2_1456[df2_1456['시도'] == "서울"]['대피소'].value_counts()[:5]

(서울    355
 경기    319
 인천     70
 부산     69
 경남     48
 Name: 시도, dtype: int64,
 한라산 진달래밭    46
 소백산 연화봉     39
 북한산 대피소     38
 설악산 중청      29
 지리산 장터목     28
 Name: 대피소, dtype: int64)

# df3 : 산림재해 관심인구 관심지역 검색정보 (Total : 7,706)

In [ ]:
len(df3)

7706

In [ ]:
df3.head()

,재해,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,산사태,의령수도사산사태로매몰위험노출/뉴스렙기사,M,4,NaN,NaN,,,NaN,서울,관악구,청림동,NaN
1,병해충,달성군산림병해충방제::재선충예방을위한예방나무주사를주는방제현장에다녀왔습니다!-달성군블...,M,4,NaN,NaN,,,NaN,서울,종로구,연건동,NaN
2,병해충,달성군산림병해충방제::재선충예방을위한예방나무주사를주는방제현장에다녀왔습니다!-달성군블...,M,4,NaN,NaN,,,NaN,서울,종로구,연건동,NaN
3,산림재해,"산림재해예방을위한하늘의눈,강릉산림항공관리소드론산불예방훈련실시",F,3,"사무직 (일반사무직, 공무원, 직업군인)",300~399만원,예,자녀 없음,연립주택/ 다세대/ 빌라,서울,동작구,상도4동,NaN
4,산사태,청도태양광산사태/조선일보,F,2,"주부 (전업주부, 파트타임 근무 주부)",400~499만원,예,자녀 있음,아파트/ 주상복합,전남,목포시,옥암동,NaN

### AGE

In [ ]:
age_counts = df3['연령'].value_counts()
age_counts

3    2749
4    2667
2    1415
5     850
1      14
6      11
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
age_counts.loc[2], round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
age_counts.loc[3], round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
age_counts.drop([2,3]).sum(), round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(4164, 54.0, 1415, 18.4, 2749, 35.7, 3542, 46.0)

In [ ]:
df3_23 = df3[df3['연령'].isin([2, 3])]
df3_2 = df3[(df3['연령'] == 2)]
df3_3 = df3[(df3['연령'] == 3)]
df3_1456 = df3[df3['연령'].isin([1, 4, 5, 6])]

### 230대 성별

In [ ]:
sex_counts = df3_23['성별'].value_counts()
sex_counts

F    2475
M    1689
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(59.4, 40.6)

### 230대 직업

In [ ]:
job_counts = df3_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             1416
학생 (초중고학생, 대학생, 대학원생)               533
주부 (전업주부, 파트타임 근무 주부)               486
무직                                  256
전문직 (의사, 판검사, 예술가, 종교인)             250
교직 (교사, 유치원교사, 학원강사)                133
자영업 (도소매업, 숙박업, 미용업)                 95
서비스직 (요식업, 숙박업, 미용실종업원)              78
생산/노무직 (생산감독, 경비원, 공장근로자)            71
기타                                   64
기능직 (자동차정비, 운전기사, 안경사, 택시기사)         58
관리직 (사장, 간부, 고위공무원)                  39
판매직 (상점점원, 보험설계사, 노점상)               29
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)       6
퇴직/연금생활자                              4
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

학생 (초중고학생, 대학생, 대학원생)    533
주부 (전업주부, 파트타임 근무 주부)    486
퇴직/연금생활자                   4
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df3_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(53.8, 2239)

In [ ]:
job2_counts = df3_2['직업'].value_counts()
job3_counts = df3_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df3_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df3_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(9.2, 383, 44.6, 1856)

### 230대 자동차

In [ ]:
car_counts = df3_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          418
중형차 (쏘나타, K5, 말리부, 골프급 등)           369
경차 (모닝, 스파크 등)                      300
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)    138
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       96
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     95
소형SUV/CUV (티볼리, QM3 등)               85
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         63
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         60
대형차 (제너시스, BMW5급 등)                  38
대형SUV (베라크루즈, 모하비, 투아렉급 등)           34
기타 (승합차/트럭/화물차/기타 차량 등)              17
준중형파생 (벨로스터, I30 등)                  13
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)        5
프리미엄 (에쿠스, BMW7급 등)                   2
중형파생 (I40 등)                          1
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df3_23) * 100, 1),\
car_counts.sum()

(41.6, 1734)

In [ ]:
car2_counts = df3_2['자동차'].value_counts()
car3_counts = df3_3['자동차'].value_counts()

round(car2_counts.sum() / len(df3_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df3_23) * 100, 1),\
car3_counts.sum()

(7.9, 331, 33.7, 1403)

### 230대 거주지

In [ ]:
df3_23['시도'].value_counts()[:5],\
df3_2['시도'].value_counts()[:5],\
df3_3['시도'].value_counts()[:5]

(서울    1270
 경기    1080
 부산     289
 인천     258
 충남     203
 Name: 시도, dtype: int64,
 서울    490
 경기    327
 부산     70
 인천     68
 충북     65
 Name: 시도, dtype: int64,
 서울    780
 경기    753
 부산    219
 인천    190
 충남    177
 Name: 시도, dtype: int64)

In [ ]:
df3_23[df3_23['시도'] == "서울"]['재해'].value_counts()[:5],\
df3_2[df3_2['시도'] == "경기"]['재해'].value_counts()[:5],\
df3_3[df3_3['시도'] == "서울"]['재해'].value_counts()[:5]

(산불      848
 산사태     208
 산림재해    179
 병해충      34
 재선충       1
 Name: 재해, dtype: int64,
 산불      168
 산사태      90
 산림재해     55
 병해충      14
 Name: 재해, dtype: int64,
 산불      554
 산림재해    105
 산사태     100
 병해충      20
 재선충       1
 Name: 재해, dtype: int64)

In [ ]:
df3_1456['시도'].value_counts()[:5],\
df3_1456[df3_1456['시도'] == "서울"]['재해'].value_counts()[:5]

(서울    1279
 경기     855
 부산     235
 충남     179
 인천     170
 Name: 시도, dtype: int64,
 산불      881
 산사태     196
 산림재해    161
 병해충      36
 재선충       5
 Name: 재해, dtype: int64)

# df4 : 산림재해 연관 검색 키워드를 검색한 관심인구 정보 정보 (Total : 340)

In [ ]:
len(df4)

340

In [ ]:
df4.head()

,재해,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
0,산사태,"제18호태풍미탁,부산사하구에산사태일으켜…4명매몰돼구조중",M,5,NaN,NaN,,,NaN,광주,남구,봉선2동,NaN
1,산사태,"폭염,호우,수난사고,산사태,추락사고,화학물사고중점관리",M,3,NaN,NaN,,,NaN,서울,강서구,등촌3동,NaN
2,산사태,"폭염,호우,수난사고,산사태,추락사고,화학물사고중점관리",M,2,NaN,NaN,,,NaN,서울,노원구,공릉1.3동,NaN
3,산림재해,"파주시,해빙기산림재해우려지역안전점검실시!",M,4,"사무직 (일반사무직, 공무원, 직업군인)",700~799만원,예,자녀 있음,아파트/ 주상복합,서울,관악구,봉천동,"중형차 (쏘나타, K5, 말리부, 골프급 등)"
4,산불,[날씨] 건조경보에 태풍급 강풍 분다..산불 초비상 | 다음 뉴스,F,5,"주부 (전업주부, 파트타임 근무 주부)",500~599만원,예,자녀 있음,아파트/ 주상복합,경기,안양시 동안구,부흥동,"경차 (모닝, 스파크 등)"

In [ ]:
age_counts = df4['연령'].value_counts()
age_counts

4    125
3    114
2     64
5     37
Name: 연령, dtype: int64

In [ ]:
age_counts.loc[[2,3]].sum(), round(age_counts.loc[[2,3]].sum() / age_counts.sum() * 100, 1),\
round(age_counts.loc[2] / age_counts.sum() * 100, 1),\
round(age_counts.loc[3] / age_counts.sum() * 100, 1),\
round(age_counts.drop([2,3]).sum() / age_counts.sum() * 100, 1)

(178, 52.4, 18.8, 33.5, 47.6)

In [ ]:
df4_23 = df4[df4['연령'].isin([2, 3])]
df4_2 = df4[(df4['연령'] == 2)]
df4_3 = df4[(df4['연령'] == 3)]
df4_45 = df4[df4['연령'].isin([4, 5])]

In [ ]:
df4_23.head()

,재해,사이트제목,성별,연령,직업,소득,결혼,자녀,주거,시도,구,동,자동차
1,산사태,"폭염,호우,수난사고,산사태,추락사고,화학물사고중점관리",M,3,NaN,NaN,,,NaN,서울,강서구,등촌3동,NaN
2,산사태,"폭염,호우,수난사고,산사태,추락사고,화학물사고중점관리",M,2,NaN,NaN,,,NaN,서울,노원구,공릉1.3동,NaN
6,산사태,"제18호태풍미탁,부산사하구에산사태일으켜…4명매몰돼구조중",M,3,NaN,NaN,,,NaN,인천,연수구,연수3동,NaN
9,산불,[날씨] 건조경보에 태풍급 강풍 분다..산불 초비상 | 다음 뉴스,M,3,"사무직 (일반사무직, 공무원, 직업군인)",400~499만원,예,자녀 있음,아파트/ 주상복합,서울,마포구,성산동,"준중형SUV (투싼, 스포티지, QM5, 티구안급 등)"
10,산불,태풍급 강풍과 건... :: 네이버 뉴스,M,3,"사무직 (일반사무직, 공무원, 직업군인)",400~499만원,아니오,,연립주택/ 다세대/ 빌라,경기,수원시 영통구,영통2동,"준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)"

### 230대 성별

In [ ]:
sex_counts = df4_23['성별'].value_counts()
sex_counts

M    96
F    82
Name: 성별, dtype: int64

In [ ]:
round(sex_counts.loc['F'] / sex_counts.sum() * 100 , 1),\
round(sex_counts.loc['M'] / sex_counts.sum() * 100 , 1)

(46.1, 53.9)

### 230대 직업

In [ ]:
df4_23['직업'].notnull().sum(), df4_23['소득'].notnull().sum()

(141, 141)

In [ ]:
job_counts = df4_23['직업'].value_counts()
job_counts

사무직 (일반사무직, 공무원, 직업군인)             64
학생 (초중고학생, 대학생, 대학원생)              18
전문직 (의사, 판검사, 예술가, 종교인)            17
주부 (전업주부, 파트타임 근무 주부)              11
무직                                 10
판매직 (상점점원, 보험설계사, 노점상)              4
생산/노무직 (생산감독, 경비원, 공장근로자)           4
교직 (교사, 유치원교사, 학원강사)                4
자영업 (도소매업, 숙박업, 미용업)                3
서비스직 (요식업, 숙박업, 미용실종업원)             2
관리직 (사장, 간부, 고위공무원)                 2
기타                                  1
농/축/광/수산업 (축산, 낙농업, 수산, 임업, 광업)     1
Name: 직업, dtype: int64

In [ ]:
drop_jobs = job_counts[job_counts.index.str.contains('학생|퇴직|주부')]
drop_jobs

학생 (초중고학생, 대학생, 대학원생)    18
주부 (전업주부, 파트타임 근무 주부)    11
Name: 직업, dtype: int64

In [ ]:
round((job_counts.sum() - drop_jobs.sum() - job_counts['무직']) / len(df4_23) * 100, 1),\
job_counts.sum() - drop_jobs.sum() - job_counts['무직']

(57.3, 102)

In [ ]:
job2_counts = df4_2['직업'].value_counts()
job3_counts = df4_3['직업'].value_counts()

In [ ]:
drop2_jobs = job2_counts[job2_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs = job3_counts[job3_counts.index.str.contains('학생|퇴직|주부')]
drop3_jobs

주부 (전업주부, 파트타임 근무 주부)    9
학생 (초중고학생, 대학생, 대학원생)    1
Name: 직업, dtype: int64

In [ ]:
round((job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직']) / len(df4_23) * 100, 1),\
job2_counts.sum() - drop2_jobs.sum() - job2_counts['무직'],\
round((job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']) / len(df4_23) * 100, 1),\
job3_counts.sum() - drop3_jobs.sum() - job3_counts['무직']

(11.8, 21, 45.5, 81)

### 230대 자동차

In [ ]:
car_counts = df4_23['자동차'].value_counts()
car_counts

준중형차 (아반떼, K3, 크루즈, 제타급 등)          16
중형차 (쏘나타, K5, 말리부, 골프급 등)           15
준대형차 (그랜저, K7, 알페온, 캠리급, 파사트급 등)     7
경차 (모닝, 스파크 등)                       5
소형SUV/CUV (티볼리, QM3 등)               4
소형차 (액센트, 프라이드, 아베오, 피아트급 등)         4
중형SUV (싼타페, 쏘렌토, 캡티바, BMW X3급 등)     4
준중형SUV (투싼, 스포티지, QM5, 티구안급 등)       3
기타 (승합차/트럭/화물차/기타 차량 등)              2
MPV (카니발, 올란도, 피카소급, 오딧세이 등)         1
준중형파생 (벨로스터, I30 등)                  1
대형SUV (베라크루즈, 모하비, 투아렉급 등)           1
스포츠 (제네시스 쿠페, BMW M, 벤츠 AMG 등)       1
대형차 (제너시스, BMW5급 등)                  1
Name: 자동차, dtype: int64

In [ ]:
round(car_counts.sum() / len(df4_23) * 100, 1),\
car_counts.sum()

(36.5, 65)

In [ ]:
car2_counts = df4_2['자동차'].value_counts()
car3_counts = df4_3['자동차'].value_counts()

round(car2_counts.sum() / len(df4_23) * 100, 1),\
car2_counts.sum(),\
round(car3_counts.sum() / len(df4_23) * 100, 1),\
car3_counts.sum()

(10.7, 19, 25.8, 46)

### 230대 거주지

In [ ]:
df4_23['시도'].value_counts()[:5],\
df4_2['시도'].value_counts()[:5],\
df4_3['시도'].value_counts()[:5]

(서울    57
 경기    36
 인천    18
 부산    18
 충남    13
 Name: 시도, dtype: int64,
 서울    24
 경기    14
 부산     5
 충북     5
 인천     4
 Name: 시도, dtype: int64,
 서울    33
 경기    22
 인천    14
 부산    13
 충남    12
 Name: 시도, dtype: int64)

In [ ]:
df4_23[df4_23['시도'] == "서울"]['재해'].value_counts()[:5],\
df4_2[df4_2['시도'] == "서울"]['재해'].value_counts()[:5],\
df4_3[df4_3['시도'] == "서울"]['재해'].value_counts()[:5]

(산사태     29
 산불      23
 산림재해     5
 Name: 재해, dtype: int64,
 산사태     12
 산불      10
 산림재해     2
 Name: 재해, dtype: int64,
 산사태     17
 산불      13
 산림재해     3
 Name: 재해, dtype: int64)

In [ ]:
df4_45['시도'].value_counts()[:5],\
df4_45[df4_45['시도'] == "서울"]['재해'].value_counts()[:5]

(서울    53
 경기    31
 부산    18
 대구     9
 대전     7
 Name: 시도, dtype: int64,
 산사태     33
 산림재해    10
 산불      10
 Name: 재해, dtype: int64)